MikroElektronika/core_packages/PIC/XC8/def/PIC16F1787/mcu.h
extern volatile ODCONCbits_t ODCONCbits __at(0x28E);
// bitfield macros
#define _ODCONC_ODCONC0_POSN                                0x0
#define _ODCONC_ODCONC0_POSITION                            0x0
#define _ODCONC_ODCONC0_SIZE                                0x1
#define _ODCONC_ODCONC0_LENGTH                              0x1
#define _ODCONC_ODCONC0_MASK                                0x1
#define _ODCONC_ODCONC1_POSN                                0x1
#define _ODCONC_ODCONC1_POSITION                            0x1
#define _ODCONC_ODCONC1_SIZE                                0x1
#define _ODCONC_ODCONC1_LENGTH                              0x1
#define _ODCONC_ODCONC1_MASK                                0x2
#define _ODCONC_ODCONC2_POSN                                0x2
#define _ODCONC_ODCONC2_POSITION                            0x2
#define _ODCONC_ODCONC2_SIZE                                0x1
#define _ODCONC_ODCONC2_LENGTH                              0x1
#define _ODCONC_ODCONC2_MASK                                0x4
#define _ODCONC_ODCONC3_POSN                                0x3
#define _ODCONC_ODCONC3_POSITION                            0x3
#define _ODCONC_ODCONC3_SIZE                                0x1
#define _ODCONC_ODCONC3_LENGTH                              0x1
#define _ODCONC_ODCONC3_MASK                                0x8
#define _ODCONC_ODCONC4_POSN                                0x4
#define _ODCONC_ODCONC4_POSITION                            0x4
#define _ODCONC_ODCONC4_SIZE                                0x1
#define _ODCONC_ODCONC4_LENGTH                              0x1
#define _ODCONC_ODCONC4_MASK                                0x10
#define _ODCONC_ODCONC5_POSN                                0x5
#define _ODCONC_ODCONC5_POSITION                            0x5
#define _ODCONC_ODCONC5_SIZE                                0x1
#define _ODCONC_ODCONC5_LENGTH                              0x1
#define _ODCONC_ODCONC5_MASK                                0x20
#define _ODCONC_ODCONC6_POSN                                0x6
#define _ODCONC_ODCONC6_POSITION                            0x6
#define _ODCONC_ODCONC6_SIZE                                0x1
#define _ODCONC_ODCONC6_LENGTH                              0x1
#define _ODCONC_ODCONC6_MASK                                0x40
#define _ODCONC_ODCONC7_POSN                                0x7
#define _ODCONC_ODCONC7_POSITION                            0x7
#define _ODCONC_ODCONC7_SIZE                                0x1
#define _ODCONC_ODCONC7_LENGTH                              0x1
#define _ODCONC_ODCONC7_MASK                                0x80
#define _ODCONC_ODCONC_POSN                                 0x0
#define _ODCONC_ODCONC_POSITION                             0x0
#define _ODCONC_ODCONC_SIZE                                 0x8
#define _ODCONC_ODCONC_LENGTH                               0x8
#define _ODCONC_ODCONC_MASK                                 0xFF

// Register: ODCOND
#define ODCOND ODCOND
extern volatile unsigned char           ODCOND              __at(0x28F);
#ifndef _LIB_BUILD
asm("ODCOND equ 028Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCOND0                :1;
        unsigned ODCOND1                :1;
        unsigned ODCOND2                :1;
        unsigned ODCOND3                :1;
        unsigned ODCOND4                :1;
        unsigned ODCOND5                :1;
        unsigned ODCOND6                :1;
        unsigned ODCOND7                :1;
    };
    struct {
        unsigned ODCOND                 :8;
    };
} ODCONDbits_t;
extern volatile ODCONDbits_t ODCONDbits __at(0x28F);
// bitfield macros
#define _ODCOND_ODCOND0_POSN                                0x0
#define _ODCOND_ODCOND0_POSITION                            0x0
#define _ODCOND_ODCOND0_SIZE                                0x1
#define _ODCOND_ODCOND0_LENGTH                              0x1
#define _ODCOND_ODCOND0_MASK                                0x1
#define _ODCOND_ODCOND1_POSN                                0x1
#define _ODCOND_ODCOND1_POSITION                            0x1
#define _ODCOND_ODCOND1_SIZE                                0x1
#define _ODCOND_ODCOND1_LENGTH                              0x1
#define _ODCOND_ODCOND1_MASK                                0x2
#define _ODCOND_ODCOND2_POSN                                0x2
#define _ODCOND_ODCOND2_POSITION                            0x2
#define _ODCOND_ODCOND2_SIZE                                0x1
#define _ODCOND_ODCOND2_LENGTH                              0x1
#define _ODCOND_ODCOND2_MASK                                0x4
#define _ODCOND_ODCOND3_POSN                                0x3
#define _ODCOND_ODCOND3_POSITION                            0x3
#define _ODCOND_ODCOND3_SIZE                                0x1
#define _ODCOND_ODCOND3_LENGTH                              0x1
#define _ODCOND_ODCOND3_MASK                                0x8
#define _ODCOND_ODCOND4_POSN                                0x4
#define _ODCOND_ODCOND4_POSITION                            0x4
#define _ODCOND_ODCOND4_SIZE                                0x1
#define _ODCOND_ODCOND4_LENGTH                              0x1
#define _ODCOND_ODCOND4_MASK                                0x10
#define _ODCOND_ODCOND5_POSN                                0x5
#define _ODCOND_ODCOND5_POSITION                            0x5
#define _ODCOND_ODCOND5_SIZE                                0x1
#define _ODCOND_ODCOND5_LENGTH                              0x1
#define _ODCOND_ODCOND5_MASK                                0x20
#define _ODCOND_ODCOND6_POSN                                0x6
#define _ODCOND_ODCOND6_POSITION                            0x6
#define _ODCOND_ODCOND6_SIZE                                0x1
#define _ODCOND_ODCOND6_LENGTH                              0x1
#define _ODCOND_ODCOND6_MASK                                0x40
#define _ODCOND_ODCOND7_POSN                                0x7
#define _ODCOND_ODCOND7_POSITION                            0x7
#define _ODCOND_ODCOND7_SIZE                                0x1
#define _ODCOND_ODCOND7_LENGTH                              0x1
#define _ODCOND_ODCOND7_MASK                                0x80
#define _ODCOND_ODCOND_POSN                                 0x0
#define _ODCOND_ODCOND_POSITION                             0x0
#define _ODCOND_ODCOND_SIZE                                 0x8
#define _ODCOND_ODCOND_LENGTH                               0x8
#define _ODCOND_ODCOND_MASK                                 0xFF

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0x290);
#ifndef _LIB_BUILD
asm("ODCONE equ 0290h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCONE0                :1;
        unsigned ODCONE1                :1;
        unsigned ODCONE2                :1;
    };
    struct {
        unsigned ODCONE                 :3;
    };
} ODCONEbits_t;
extern volatile ODCONEbits_t ODCONEbits __at(0x290);
// bitfield macros
#define _ODCONE_ODCONE0_POSN                                0x0
#define _ODCONE_ODCONE0_POSITION                            0x0
#define _ODCONE_ODCONE0_SIZE                                0x1
#define _ODCONE_ODCONE0_LENGTH                              0x1
#define _ODCONE_ODCONE0_MASK                                0x1
#define _ODCONE_ODCONE1_POSN                                0x1
#define _ODCONE_ODCONE1_POSITION                            0x1
#define _ODCONE_ODCONE1_SIZE                                0x1
#define _ODCONE_ODCONE1_LENGTH                              0x1
#define _ODCONE_ODCONE1_MASK                                0x2
#define _ODCONE_ODCONE2_POSN                                0x2
#define _ODCONE_ODCONE2_POSITION                            0x2
#define _ODCONE_ODCONE2_SIZE                                0x1
#define _ODCONE_ODCONE2_LENGTH                              0x1
#define _ODCONE_ODCONE2_MASK                                0x4
#define _ODCONE_ODCONE_POSN                                 0x0
#define _ODCONE_ODCONE_POSITION                             0x0
#define _ODCONE_ODCONE_SIZE                                 0x3
#define _ODCONE_ODCONE_LENGTH                               0x3
#define _ODCONE_ODCONE_MASK                                 0x7

// Register: CCPR1
#define CCPR1 CCPR1
extern volatile unsigned short          CCPR1               __at(0x291);
#ifndef _LIB_BUILD
asm("CCPR1 equ 0291h");
#endif

// Register: CCPR1L
#define CCPR1L CCPR1L
extern volatile unsigned char           CCPR1L              __at(0x291);
#ifndef _LIB_BUILD
asm("CCPR1L equ 0291h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR1L                 :8;
    };
} CCPR1Lbits_t;
extern volatile CCPR1Lbits_t CCPR1Lbits __at(0x291);
// bitfield macros
#define _CCPR1L_CCPR1L_POSN                                 0x0
#define _CCPR1L_CCPR1L_POSITION                             0x0
#define _CCPR1L_CCPR1L_SIZE                                 0x8
#define _CCPR1L_CCPR1L_LENGTH                               0x8
#define _CCPR1L_CCPR1L_MASK                                 0xFF

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0x292);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0292h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR1H                 :8;
    };
} CCPR1Hbits_t;
extern volatile CCPR1Hbits_t CCPR1Hbits __at(0x292);
// bitfield macros
#define _CCPR1H_CCPR1H_POSN                                 0x0
#define _CCPR1H_CCPR1H_POSITION                             0x0
#define _CCPR1H_CCPR1H_SIZE                                 0x8
#define _CCPR1H_CCPR1H_LENGTH                               0x8
#define _CCPR1H_CCPR1H_MASK                                 0xFF

// Register: CCP1CON
#define CCP1CON CCP1CON
extern volatile unsigned char           CCP1CON             __at(0x293);
#ifndef _LIB_BUILD
asm("CCP1CON equ 0293h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1M                  :4;
        unsigned DC1B                   :2;
    };
    struct {
        unsigned CCP1M0                 :1;
        unsigned CCP1M1                 :1;
        unsigned CCP1M2                 :1;
        unsigned CCP1M3                 :1;
        unsigned DC1B0                  :1;
        unsigned DC1B1                  :1;
    };
} CCP1CONbits_t;
extern volatile CCP1CONbits_t CCP1CONbits __at(0x293);
// bitfield macros
#define _CCP1CON_CCP1M_POSN                                 0x0
#define _CCP1CON_CCP1M_POSITION                             0x0
#define _CCP1CON_CCP1M_SIZE                                 0x4
#define _CCP1CON_CCP1M_LENGTH                               0x4
#define _CCP1CON_CCP1M_MASK                                 0xF
#define _CCP1CON_DC1B_POSN                                  0x4
#define _CCP1CON_DC1B_POSITION                              0x4
#define _CCP1CON_DC1B_SIZE                                  0x2
#define _CCP1CON_DC1B_LENGTH                                0x2
#define _CCP1CON_DC1B_MASK                                  0x30
#define _CCP1CON_CCP1M0_POSN                                0x0
#define _CCP1CON_CCP1M0_POSITION                            0x0
#define _CCP1CON_CCP1M0_SIZE                                0x1
#define _CCP1CON_CCP1M0_LENGTH                              0x1
#define _CCP1CON_CCP1M0_MASK                                0x1
#define _CCP1CON_CCP1M1_POSN                                0x1
#define _CCP1CON_CCP1M1_POSITION                            0x1
#define _CCP1CON_CCP1M1_SIZE                                0x1
#define _CCP1CON_CCP1M1_LENGTH                              0x1
#define _CCP1CON_CCP1M1_MASK                                0x2
#define _CCP1CON_CCP1M2_POSN                                0x2
#define _CCP1CON_CCP1M2_POSITION                            0x2
#define _CCP1CON_CCP1M2_SIZE                                0x1
#define _CCP1CON_CCP1M2_LENGTH                              0x1
#define _CCP1CON_CCP1M2_MASK                                0x4
#define _CCP1CON_CCP1M3_POSN                                0x3
#define _CCP1CON_CCP1M3_POSITION                            0x3
#define _CCP1CON_CCP1M3_SIZE                                0x1
#define _CCP1CON_CCP1M3_LENGTH                              0x1
#define _CCP1CON_CCP1M3_MASK                                0x8
#define _CCP1CON_DC1B0_POSN                                 0x4
#define _CCP1CON_DC1B0_POSITION                             0x4
#define _CCP1CON_DC1B0_SIZE                                 0x1
#define _CCP1CON_DC1B0_LENGTH                               0x1
#define _CCP1CON_DC1B0_MASK                                 0x10
#define _CCP1CON_DC1B1_POSN                                 0x5
#define _CCP1CON_DC1B1_POSITION                             0x5
#define _CCP1CON_DC1B1_SIZE                                 0x1
#define _CCP1CON_DC1B1_LENGTH                               0x1
#define _CCP1CON_DC1B1_MASK                                 0x20

// Register: CCPR2
#define CCPR2 CCPR2
extern volatile unsigned short          CCPR2               __at(0x298);
#ifndef _LIB_BUILD
asm("CCPR2 equ 0298h");
#endif

// Register: CCPR2L
#define CCPR2L CCPR2L
extern volatile unsigned char           CCPR2L              __at(0x298);
#ifndef _LIB_BUILD
asm("CCPR2L equ 0298h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR2L                 :8;
    };
} CCPR2Lbits_t;
