MikroElektronika/core_packages/PIC/XC8/def/PIC16F1787/mcu.h
// Register: PSMC2BLKF
#define PSMC2BLKF PSMC2BLKF
extern volatile unsigned char           PSMC2BLKF           __at(0x84C);
#ifndef _LIB_BUILD
asm("PSMC2BLKF equ 084Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2BLKF0             :1;
        unsigned PSMC2BLKF1             :1;
        unsigned PSMC2BLKF2             :1;
        unsigned PSMC2BLKF3             :1;
        unsigned PSMC2BLKF4             :1;
        unsigned PSMC2BLKF5             :1;
        unsigned PSMC2BLKF6             :1;
        unsigned PSMC2BLKF7             :1;
    };
} PSMC2BLKFbits_t;
extern volatile PSMC2BLKFbits_t PSMC2BLKFbits __at(0x84C);
// bitfield macros
#define _PSMC2BLKF_PSMC2BLKF0_POSN                          0x0
#define _PSMC2BLKF_PSMC2BLKF0_POSITION                      0x0
#define _PSMC2BLKF_PSMC2BLKF0_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF0_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF0_MASK                          0x1
#define _PSMC2BLKF_PSMC2BLKF1_POSN                          0x1
#define _PSMC2BLKF_PSMC2BLKF1_POSITION                      0x1
#define _PSMC2BLKF_PSMC2BLKF1_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF1_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF1_MASK                          0x2
#define _PSMC2BLKF_PSMC2BLKF2_POSN                          0x2
#define _PSMC2BLKF_PSMC2BLKF2_POSITION                      0x2
#define _PSMC2BLKF_PSMC2BLKF2_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF2_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF2_MASK                          0x4
#define _PSMC2BLKF_PSMC2BLKF3_POSN                          0x3
#define _PSMC2BLKF_PSMC2BLKF3_POSITION                      0x3
#define _PSMC2BLKF_PSMC2BLKF3_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF3_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF3_MASK                          0x8
#define _PSMC2BLKF_PSMC2BLKF4_POSN                          0x4
#define _PSMC2BLKF_PSMC2BLKF4_POSITION                      0x4
#define _PSMC2BLKF_PSMC2BLKF4_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF4_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF4_MASK                          0x10
#define _PSMC2BLKF_PSMC2BLKF5_POSN                          0x5
#define _PSMC2BLKF_PSMC2BLKF5_POSITION                      0x5
#define _PSMC2BLKF_PSMC2BLKF5_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF5_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF5_MASK                          0x20
#define _PSMC2BLKF_PSMC2BLKF6_POSN                          0x6
#define _PSMC2BLKF_PSMC2BLKF6_POSITION                      0x6
#define _PSMC2BLKF_PSMC2BLKF6_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF6_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF6_MASK                          0x40
#define _PSMC2BLKF_PSMC2BLKF7_POSN                          0x7
#define _PSMC2BLKF_PSMC2BLKF7_POSITION                      0x7
#define _PSMC2BLKF_PSMC2BLKF7_SIZE                          0x1
#define _PSMC2BLKF_PSMC2BLKF7_LENGTH                        0x1
#define _PSMC2BLKF_PSMC2BLKF7_MASK                          0x80

// Register: PSMC2FFA
#define PSMC2FFA PSMC2FFA
extern volatile unsigned char           PSMC2FFA            __at(0x84D);
#ifndef _LIB_BUILD
asm("PSMC2FFA equ 084Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2FFA0              :1;
        unsigned PSMC2FFA1              :1;
        unsigned PSMC2FFA2              :1;
        unsigned PSMC2FFA3              :1;
    };
} PSMC2FFAbits_t;
extern volatile PSMC2FFAbits_t PSMC2FFAbits __at(0x84D);
// bitfield macros
#define _PSMC2FFA_PSMC2FFA0_POSN                            0x0
#define _PSMC2FFA_PSMC2FFA0_POSITION                        0x0
#define _PSMC2FFA_PSMC2FFA0_SIZE                            0x1
#define _PSMC2FFA_PSMC2FFA0_LENGTH                          0x1
#define _PSMC2FFA_PSMC2FFA0_MASK                            0x1
#define _PSMC2FFA_PSMC2FFA1_POSN                            0x1
#define _PSMC2FFA_PSMC2FFA1_POSITION                        0x1
#define _PSMC2FFA_PSMC2FFA1_SIZE                            0x1
#define _PSMC2FFA_PSMC2FFA1_LENGTH                          0x1
#define _PSMC2FFA_PSMC2FFA1_MASK                            0x2
#define _PSMC2FFA_PSMC2FFA2_POSN                            0x2
#define _PSMC2FFA_PSMC2FFA2_POSITION                        0x2
#define _PSMC2FFA_PSMC2FFA2_SIZE                            0x1
#define _PSMC2FFA_PSMC2FFA2_LENGTH                          0x1
#define _PSMC2FFA_PSMC2FFA2_MASK                            0x4
#define _PSMC2FFA_PSMC2FFA3_POSN                            0x3
#define _PSMC2FFA_PSMC2FFA3_POSITION                        0x3
#define _PSMC2FFA_PSMC2FFA3_SIZE                            0x1
#define _PSMC2FFA_PSMC2FFA3_LENGTH                          0x1
#define _PSMC2FFA_PSMC2FFA3_MASK                            0x8

// Register: PSMC2STR0
#define PSMC2STR0 PSMC2STR0
extern volatile unsigned char           PSMC2STR0           __at(0x84E);
#ifndef _LIB_BUILD
asm("PSMC2STR0 equ 084Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2STRA                 :1;
        unsigned P2STRB                 :1;
    };
} PSMC2STR0bits_t;
extern volatile PSMC2STR0bits_t PSMC2STR0bits __at(0x84E);
// bitfield macros
#define _PSMC2STR0_P2STRA_POSN                              0x0
#define _PSMC2STR0_P2STRA_POSITION                          0x0
#define _PSMC2STR0_P2STRA_SIZE                              0x1
#define _PSMC2STR0_P2STRA_LENGTH                            0x1
#define _PSMC2STR0_P2STRA_MASK                              0x1
#define _PSMC2STR0_P2STRB_POSN                              0x1
#define _PSMC2STR0_P2STRB_POSITION                          0x1
#define _PSMC2STR0_P2STRB_SIZE                              0x1
#define _PSMC2STR0_P2STRB_LENGTH                            0x1
#define _PSMC2STR0_P2STRB_MASK                              0x2

// Register: PSMC2STR1
#define PSMC2STR1 PSMC2STR1
extern volatile unsigned char           PSMC2STR1           __at(0x84F);
#ifndef _LIB_BUILD
asm("PSMC2STR1 equ 084Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2HSMEN                :1;
        unsigned P2LSMEN                :1;
        unsigned                        :5;
        unsigned P2SSYNC                :1;
    };
} PSMC2STR1bits_t;
extern volatile PSMC2STR1bits_t PSMC2STR1bits __at(0x84F);
// bitfield macros
#define _PSMC2STR1_P2HSMEN_POSN                             0x0
#define _PSMC2STR1_P2HSMEN_POSITION                         0x0
#define _PSMC2STR1_P2HSMEN_SIZE                             0x1
#define _PSMC2STR1_P2HSMEN_LENGTH                           0x1
#define _PSMC2STR1_P2HSMEN_MASK                             0x1
#define _PSMC2STR1_P2LSMEN_POSN                             0x1
#define _PSMC2STR1_P2LSMEN_POSITION                         0x1
#define _PSMC2STR1_P2LSMEN_SIZE                             0x1
#define _PSMC2STR1_P2LSMEN_LENGTH                           0x1
#define _PSMC2STR1_P2LSMEN_MASK                             0x2
#define _PSMC2STR1_P2SSYNC_POSN                             0x7
#define _PSMC2STR1_P2SSYNC_POSITION                         0x7
#define _PSMC2STR1_P2SSYNC_SIZE                             0x1
#define _PSMC2STR1_P2SSYNC_LENGTH                           0x1
#define _PSMC2STR1_P2SSYNC_MASK                             0x80

